{"keras_version": "2.1.3", "backend": "tensorflow", "class_name": "Model", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 48, 48], "dtype": "float32", "sparse": false, "name": "input_1"}, "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 32, "kernel_constraint": null, "name": "conv2d_1", "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "data_format": "channels_first", "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null}, "name": "conv2d_1"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Dropout", "config": {"rate": 0.2, "seed": null, "name": "dropout_1", "noise_shape": null, "trainable": true}, "name": "dropout_1"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 32, "kernel_constraint": null, "name": "conv2d_2", "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "data_format": "channels_first", "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null}, "name": "conv2d_2"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "data_format": "channels_first", "trainable": true}, "name": "max_pooling2d_1"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 64, "kernel_constraint": null, "name": "conv2d_3", "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "data_format": "channels_first", "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null}, "name": "conv2d_3"}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Dropout", "config": {"rate": 0.2, "seed": null, "name": "dropout_2", "noise_shape": null, "trainable": true}, "name": "dropout_2"}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 64, "kernel_constraint": null, "name": "conv2d_4", "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "data_format": "channels_first", "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null}, "name": "conv2d_4"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "strides": [2, 2], "data_format": "channels_first", "trainable": true}, "name": "max_pooling2d_2"}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 128, "kernel_constraint": null, "name": "conv2d_5", "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "data_format": "channels_first", "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null}, "name": "conv2d_5"}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "Dropout", "config": {"rate": 0.2, "seed": null, "name": "dropout_3", "noise_shape": null, "trainable": true}, "name": "dropout_3"}, {"inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 128, "kernel_constraint": null, "name": "conv2d_6", "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "data_format": "channels_first", "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null}, "name": "conv2d_6"}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"size": [2, 2], "name": "up_sampling2d_1", "data_format": "channels_first", "trainable": true}, "name": "up_sampling2d_1"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}], ["up_sampling2d_1", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_1", "axis": 1, "trainable": true}, "name": "concatenate_1"}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 64, "kernel_constraint": null, "name": "conv2d_7", "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "data_format": "channels_first", "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null}, "name": "conv2d_7"}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "Dropout", "config": {"rate": 0.2, "seed": null, "name": "dropout_4", "noise_shape": null, "trainable": true}, "name": "dropout_4"}, {"inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 64, "kernel_constraint": null, "name": "conv2d_8", "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "data_format": "channels_first", "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null}, "name": "conv2d_8"}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "class_name": "UpSampling2D", "config": {"size": [2, 2], "name": "up_sampling2d_2", "data_format": "channels_first", "trainable": true}, "name": "up_sampling2d_2"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}], ["up_sampling2d_2", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_2", "axis": 1, "trainable": true}, "name": "concatenate_2"}, {"inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 32, "kernel_constraint": null, "name": "conv2d_9", "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "data_format": "channels_first", "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null}, "name": "conv2d_9"}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "class_name": "Dropout", "config": {"rate": 0.2, "seed": null, "name": "dropout_5", "noise_shape": null, "trainable": true}, "name": "dropout_5"}, {"inbound_nodes": [[["dropout_5", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 32, "kernel_constraint": null, "name": "conv2d_10", "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "data_format": "channels_first", "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null}, "name": "conv2d_10"}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "class_name": "Conv2D", "config": {"filters": 2, "kernel_constraint": null, "name": "conv2d_11", "activation": "relu", "dilation_rate": [1, 1], "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "trainable": true, "data_format": "channels_first", "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null}, "name": "conv2d_11"}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "class_name": "Reshape", "config": {"target_shape": [2, 2304], "name": "reshape_1", "trainable": true}, "name": "reshape_1"}, {"inbound_nodes": [[["reshape_1", 0, 0, {}]]], "class_name": "Permute", "config": {"dims": [2, 1], "name": "permute_1", "trainable": true}, "name": "permute_1"}, {"inbound_nodes": [[["permute_1", 0, 0, {}]]], "class_name": "Activation", "config": {"name": "activation_1", "activation": "softmax", "trainable": true}, "name": "activation_1"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["activation_1", 0, 0]]}}